# Pandas - Data Cleaning

1. Renaming Columns
2. Re-arranging Column Order
3. Checking data types of specific columns
4. Removing Text from column
5. Deaing with Missing Data
6. Changing Data Types
7. Replacing Text within a column
8. String operations of column data
9. Removing Columns
10. Dropping Rows

In [1]:
# Load Amazon fire on rainforest
import pandas as pd

df = pd.read_csv("datasets/amazon_fires.csv")

df.head()

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

In [2]:
# How many regions are in the dataset?

df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'parï¿½', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Renaming Columns

In [3]:
new_columns = {'ano' : 'year',
               'estado' : 'state',
               'mes' : 'month',
               'numero' : 'number_of_fires',
               'encontro' : 'date'}

df.rename(columns = new_columns, inplace=True)

In [4]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [5]:
# how many years of data do we have?
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017], dtype=int64)

In [6]:
# exsplore dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

# Re-arranging Columns

In [7]:
# Columns are numbered from 0, left to right
# Let's put date first, month second, and year 3rd

new_order = [4,1,0,2,3]
df = df[df.columns[new_order]]
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [8]:
df.tail(10)

          date     month  year      state number_of_fires
6444  1/1/2007  Dezembro  2007  Tocantins              13
6445  1/1/2008  Dezembro  2008  Tocantins               7
6446  1/1/2009  Dezembro  2009  Tocantins              46
6447  1/1/2010  Dezembro  2010  Tocantins              72
6448  1/1/2011  Dezembro  2011  Tocantins             105
6449  1/1/2012  Dezembro  2012  Tocantins             128
6450  1/1/2013  Dezembro  2013  Tocantins              85
6451  1/1/2014  Dezembro  2014  Tocantins             223
6452  1/1/2015  Dezembro  2015  Tocantins             373
6453  1/1/2016  Dezembro  2016  Tocantins             119

# Determining if a column contains numeric data

In [9]:
df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [10]:
df[df['number_of_fires'].str.isdigit()]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [11]:
# We get the above error because our isdigit() returns Nan for blank or missing values
# To fix this we need to convert our column datatype from non-null objects to a String

df['number_of_fires'].astype(str).str.isdigit()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: bool

- Bascially, `str.isdigit` only returns True for strings containing solely the digits 0-9. 
- By contrast, `str.isnumeric` returns True if it contains any numeric characters. e.g. 'Â½'

# Removing unnecessary text from columns

In [12]:
df['number_of_fires'].str.strip(" Fires")

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

Strip - Return a copy of the string with leading and trailing characters removed. If chars is omitted or None, whitespace characters are removed. If given and not None, chars must be a string; the characters in the string will be stripped from the both ends of the string this method is called on.

In [13]:
# Replace column with cleaned column

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [15]:
# We need to convert our number_of_fires column to a float data type
# Also, here's an alternative string manipulation technique we can use

df['number_of_fires'] = df['number_of_fires'].str.replace('','0').astype(float)
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

# Handling misssing data

In [16]:
df = pd.read_csv("datasets/amazon_fires.csv")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
#save copy new_df
df_copy = df.copy()

df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [17]:
# Veiwing the sum of misssing values in each column

df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [18]:
# we can easily remove Null or NaN (not a number) values

# Drop rows with NaN Values
df = df.dropna()
df = df. reset_index() # reset"s row indexes in case any rows were dropped
df.head()

   index  year    month state number_of_fires      date
0      0  1998  Janeiro  Acre               0  1/1/1998
1      1  1999  Janeiro  Acre               0  1/1/1999
2      2  2000  Janeiro  Acre               0  1/1/2000
3      3  2001  Janeiro  Acre               0  1/1/2001
4      4  2002  Janeiro  Acre               0  1/1/2002

In [19]:
# Let's check and see it worked?

df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

# What do to with missing data?

* Remove them via .dropna(axis=0)
* Replace them with some arbitary number (e.g. an average)
* Replace them zeros, or Forward Fill (ffill) or Back Fill (backfill)

In [20]:
# Using fillna with zeros


df['number_of_fires'].fillna(0).head()

0    0
1    0
2    0
3    0
4    0
Name: number_of_fires, dtype: object

In [21]:
# Let's try back filling
df['number_of_fires'].fillna(method='ffill').head(70)

0     0
1     0
2     0
3     0
4     0
     ..
65    1
66    2
67    1
68    0
69    0
Name: number_of_fires, Length: 70, dtype: object

In [22]:
# View index 444 to see how it changes
# Homework, change 444 using ffill and backfill to see how it changes
df.iloc[444]

index                   450
year                   2008
month              Novembro
state               alagoas
number_of_fires          37
date               1/1/2008
Name: 444, dtype: object

In [23]:
df.iloc[445]

index                   451
year                   2009
month              Novembro
state               alagoas
number_of_fires          55
date               1/1/2009
Name: 445, dtype: object

# Assigning data types to our columns

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6322 entries, 0 to 6321
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            6322 non-null   int64
 1   year             6322 non-null   int64
 2   month            6322 non-null   object
 3   state            6322 non-null   object
 4   number_of_fires  6322 non-null   object
 5   date             6322 non-null   object
dtypes: int64(2), object(4)
memory usage: 296.5+ KB

In [25]:
df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)

In [26]:
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  Janeiro  Acre              0.0  1/1/1998
1      1  1999  Janeiro  Acre              0.0  1/1/1999
2      2  2000  Janeiro  Acre              0.0  1/1/2000
3      3  2001  Janeiro  Acre              0.0  1/1/2001
4      4  2002  Janeiro  Acre              0.0  1/1/2002

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6322 entries, 0 to 6321
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            6322 non-null   int64
 1   year             6322 non-null   int64
 2   month            6322 non-null   object
 3   state            6322 non-null   object
 4   number_of_fires  6322 non-null   float64
 5   date             6322 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 296.5+ KB

In [28]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Marï¿½o', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

# Replacing text in columns

In [29]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'MarÃ§o': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  January  Acre              0.0  1/1/1998
1      1  1999  January  Acre              0.0  1/1/1999
2      2  2000  January  Acre              0.0  1/1/2000
3      3  2001  January  Acre              0.0  1/1/2001
4      4  2002  January  Acre              0.0  1/1/2002

In [30]:
df.isnull().sum()

index                0
year                 0
month              528
state                0
number_of_fires      0
date                 0
dtype: int64

In [31]:
df['month'].unique()

array(['January', 'February', nan, 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype=object)

# Further string functions on columns

In [32]:
df['state'] = df['state'].str.title()
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Parï¿½', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [33]:
# Removing Columns

In [34]:
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  January  Acre              0.0  1/1/1998
1      1  1999  January  Acre              0.0  1/1/1999
2      2  2000  January  Acre              0.0  1/1/2000
3      3  2001  January  Acre              0.0  1/1/2001
4      4  2002  January  Acre              0.0  1/1/2002

In [35]:
# Dropping multiple columns
df = df.drop("date", axis=1) # axis = 1 so that it works across our columns
df.head()

   index  year    month state  number_of_fires
0      0  1998  January  Acre              0.0
1      1  1999  January  Acre              0.0
2      2  2000  January  Acre              0.0
3      3  2001  January  Acre              0.0
4      4  2002  January  Acre              0.0

In [37]:
# Drop multiple columns 
df = df.drop(["year", "index"], axis=1)
df.head()

     month state  number_of_fires
0  January  Acre              0.0
1  January  Acre              0.0
2  January  Acre              0.0
3  January  Acre              0.0
4  January  Acre              0.0

# Dropping Rows
Using df.index function

In [39]:
# Let's drop the first row 
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index    month state  number_of_fires
0      1  January  Acre              0.0
1      2  January  Acre              0.0
2      3  January  Acre              0.0
3      4  January  Acre              0.0
4      5  January  Acre           1000.0

In [40]:
# Drop multiple rows

df = df.drop(df.index[[2,3]])
df.head()

   index    month state  number_of_fires
0      1  January  Acre              0.0
1      2  January  Acre              0.0
4      5  January  Acre           1000.0
5      6  January  Acre              0.0
6      7  January  Acre           1020.0

In [41]:
# Drop a range of rows

df = df.drop(df.index[1:4])
df.head()

   index    month state  number_of_fires
0      1  January  Acre              0.0
6      7  January  Acre           1020.0
7      8  January  Acre             40.0
8      9  January  Acre              0.0
9     10  January  Acre              0.0